Revit 2024 API
AssetProperty.IsEditable Method
 Check if property can be edited.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public bool IsEditable()
Visual Basic
Public Function IsEditable As Boolean
Visual C++
public:
bool IsEditable()
Return Value
 True if property is editable.
Remarks
 Properties can be edited only if there is an active Edit Scope and if the property is allowed to be changed.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The asset property is not editable. Asset can be edited only in an edit scope.
See Also
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace